namespace CannabisPlantations.WebApi.Utility
{
    public class StaticDetails
    {
        public const string SwaggerDescription = "**Найкраща г...** *Нордична країна у Північній Європі." +
            "  Межує зі Швецією на заході, Норвегією на північному заході та* **Болотом** *на сході." +
            "  На півдні й заході береги країни омивають води Балтійського моря та його заток — Фінської і Ботнічної." +
            "  Столиця і найбільше місто — Гельсінкі." +
            "  Населення країни становить 5,53 млн осіб (станом на березень 2022), більшість із яких проживає у центральній і південній частинах країни." +
            "  Восьма за площею країна Європи і найбільша малонаселена країна Європейського Союзу. " +
            "  Фінляндія є парламентською республікою з 311 муніципалітетами й автономним регіоном Аландські острови. " +
            "  Понад 1,4 млн осіб проживає у столичній зоні Великого Гельсінкі, який виробляє більше третини ВВП країни.*";
        public const string QueryDescription1 = "Для агронома A знайти усiх споживачiв, яким вiн продавав продукт хоча б N разiв за\r\nвказаний перiод (з дати F по дату T)";
        public const string QueryDescription2 = "Для споживача С знайти усi продукти, якi вiн придбав за вказаний перiод (з дати F по дату\r\nT)";
        public const string QueryDescription3 = "Для споживача С знайти усiх агрономiв, якi проводили для нього дегустацiю хоча б N разiв\r\nза вказаний перiод (з дати F по дату T)";
        public const string QueryDescription4 = "Для агронома А знайти усiх агрономiв, з якими вiн їздив у вiдрядження протягом вказаного\r\nперiоду (з дати F по дату T)";
        public const string QueryDescription5 = "Для споживача С знайти усiх агрономiв, якi продали йому хоча б щось та провели для нього\r\nхоча б одну дегустацiю протягом вказаного перiоду (з дати F по дату T);";
        public const string QueryDescription6 = "Знайти усiх споживачiв, якi купили щонайменше N рiзних продуктiв за вказаний перiод (з дати F по дату T);";
        public const string QueryDescription7 = "Знайти усiх агрономiв, якi збирали урожай хоча б N рiзних сортiв коноплi за вказаний перiод (з дати F по дату T);";
        public const string QueryDescription8 = "Знайти усi спiльнi дегустацiї для споживача С та агронома А за вказаний перiод (з дати F по дату T)";
        public const string QueryDescription9 = "Для агронома A та кожного продукту, дегустацiю якого вiн проводив, знайти скiльки разiв за вказаний перiод (з дати F по дату T) вiн проводив дегустацiю для щонайменше N\r\nспоживачiв;";
        public const string QueryDescription10 = "Для споживача С знайти сумарну кiлькiсть вiдгукiв по мiсяцях, якi вiн залишив за вказаний перiод (з дати F по дату T);";
        public const string QueryDescription11 = "Вивести сорти коноплi у порядку спадання кiлькостi вiдряджень, у якi їздили агрономи, що збирали його урожай хоча б N разiв за вказаний перiод (з дати F по дату T);";
        public const string QueryDescription12 = "Вивести продукти, якi були придбанi щонайменше N рiзними споживачами у порядку спадання вiдсотку повернень за вказаний перiод (з дати F по дату T);";

    }
}
