namespace CannabisPlantations.WebApi.Utility
{
    public class StaticDetails
    {
        public const string SwaggerDescription = "**Найкраща г...** *Нордична країна у Північній Європі." +
            "  Межує зі Швецією на заході, Норвегією на північному заході та* **Болотом** *на сході." +
            "  На півдні й заході береги країни омивають води Балтійського моря та його заток — Фінської і Ботнічної." +
            "  Столиця і найбільше місто — Гельсінкі." +
            "  Населення країни становить 5,53 млн осіб (станом на березень 2022), більшість із яких проживає у центральній і південній частинах країни." +
            "  Восьма за площею країна Європи і найбільша малонаселена країна Європейського Союзу. " +
            "  Фінляндія є парламентською республікою з 311 муніципалітетами й автономним регіоном Аландські острови. " +
            "  Понад 1,4 млн осіб проживає у столичній зоні Великого Гельсінкі, який виробляє більше третини ВВП країни.*";

    }
}
